cases/diamond_Re150/dl_amr/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;
